Dipto9999/Self_Balancing_Robot/STM32/ExtraFeatures/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DISTANCE_SENSOR_FRONT_INPUT_CAPTURE_Pin GPIO_PIN_0
#define DISTANCE_SENSOR_FRONT_INPUT_CAPTURE_GPIO_Port GPIOA
#define DISTANCE_SENSOR_FRONT_PULSE_Pin GPIO_PIN_1
#define DISTANCE_SENSOR_FRONT_PULSE_GPIO_Port GPIOA
#define DISTANCE_SENSOR_BACK_INPUT_CAPTURE_Pin GPIO_PIN_2
#define DISTANCE_SENSOR_BACK_INPUT_CAPTURE_GPIO_Port GPIOA
#define DISTANCE_SENSOR_BACK_PULSE_Pin GPIO_PIN_3
#define DISTANCE_SENSOR_BACK_PULSE_GPIO_Port GPIOA
#define LCD_RS_Pin GPIO_PIN_1
#define LCD_RS_GPIO_Port GPIOB
#define LCD_EN_Pin GPIO_PIN_8
#define LCD_EN_GPIO_Port GPIOA
#define LCD_D4_Pin GPIO_PIN_11
#define LCD_D4_GPIO_Port GPIOA
#define LCD_D5_Pin GPIO_PIN_12
#define LCD_D5_GPIO_Port GPIOA
#define LCD_D6_Pin GPIO_PIN_15
#define LCD_D6_GPIO_Port GPIOA
#define LCD_D7_Pin GPIO_PIN_3
#define LCD_D7_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
